src/InformationRegisters/КурсыВалют/КурсыВалют.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КурсыВалют</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>Independent</writeMode>
  <resources>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Кратность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>0</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюта</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/Валюта/Валюта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Валюта</name>
  <predefined>
    <items>
      <name>ДолларСША</name>
      <description>Доллар (США)</description>
    </items>
    <items>
      <name>Евро</name>
      <description>Евро</description>
    </items>
    <items>
      <name>Рубль</name>
      <description>Рубль</description>
    </items>
    <items>
      <name>Тенге</name>
      <description>Тенге</description>
    </items>
  </predefined>
</mdclass:Catalog>

src/CommonModules/ОбщийМодульСервер_КурсыВалют/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Общий модуль сервер: курсы валют.
// Получение курса, пересчёт в валюту учёта, загрузка курсов из интернета.
// Источник: open.er-api.com (курсы относительно валюты учёта).
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Возвращает данные курса валюты на дату.
// Если валюта совпадает с валютой учёта — курс 1, кратность 1.
// При отсутствии курса возвращает Неопределено.
//
Функция ПолучитьДанныеКурса(Валюта, ДатаКурса) Экспорт
	
	ВалютаУчета = Константы.ВалютаУчета.Получить();
	
	Если Не ЗначениеЗаполнено(Валюта) Тогда
		
		Возврат Неопределено;
		
	КонецЕсли;
	
	Если Валюта = ВалютаУчета Тогда
		
		Результат = Новый Структура;
		Результат.Вставить("Курс", 1);
		Результат.Вставить("Кратность", 1);
		Результат.Вставить("Период", НачалоДня(ДатаКурса));
		Возврат Результат;
		
	КонецЕсли;
	
	ДатаСреза = НачалоДня(ДатаКурса);
	ИспользоватьПоследний = Константы.ИспользоватьПоследнийИзвестныйКурс.Получить();
	
	Если ИспользоватьПоследний Тогда
		
		Возврат КурсИзСрезаПоследних(Валюта, ДатаСреза);
		
	КонецЕсли;
	
	Возврат КурсНаТочнуюДату(Валюта, ДатаСреза);
	
КонецФункции

// Пересчитывает сумму из валюты операции в валюту учёта.
// При отсутствии курса вызывает исключение с понятным текстом.
//
Функция СуммаВВалютеУчета(СуммаВВалюте, Валюта, ДатаКурса) Экспорт
	
	ДанныеКурса = ПолучитьДанныеКурса(Валюта, ДатаКурса);
	
	Если ДанныеКурса = Неопределено Тогда
		
		ВызватьИсключение ТекстСообщенияОбОтсутствииКурса(Валюта, ДатаКурса);
		
	КонецЕсли;
	
	Если ДанныеКурса.Кратность = 0 Тогда
		
		ВызватьИсключение "Кратность курса валюты не может быть равна нулю.";
		
	КонецЕсли;
	
	Возврат Окр(СуммаВВалюте * ДанныеКурса.Курс / ДанныеКурса.Кратность, 2);
	
КонецФункции

// Проверяет наличие курса для валюты операции.
// Для валюты учёта проверка не требуется.
// При ошибке вызывает исключение.
//
Процедура ПроверитьНаличиеКурса(Валюта, ДатаКурса) Экспорт
	
	ВалютаУчета = Константы.ВалютаУчета.Получить();
	
	Если Не ЗначениеЗаполнено(Валюта) Или Валюта = ВалютаУчета Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если ПолучитьДанныеКурса(Валюта, ДатаКурса) = Неопределено Тогда
		
		ВызватьИсключение ТекстСообщенияОбОтсутствииКурса(Валюта, ДатаКурса);
		
	КонецЕсли;
	
КонецПроцедуры

// Возвращает символ валюты для отображения сумм (₸, ₽, €, $).
//
Функция СимволВалюты(Валюта) Экспорт
	
	Если Не ЗначениеЗаполнено(Валюта) Тогда
		
		Возврат "";
		
	КонецЕсли;
	
	Если Валюта = Справочники.Валюта.Тенге Тогда
		
		Возврат "₸";
		
	ИначеЕсли Валюта = Справочники.Валюта.Рубль Тогда
		
		Возврат "₽";
		
	ИначеЕсли Валюта = Справочники.Валюта.Евро Тогда
		
		Возврат "€";
		
	ИначеЕсли Валюта = Справочники.Валюта.ДолларСША Тогда
		
		Возврат "$";
		
	КонецЕсли;
	
	Возврат Строка(Валюта);
	
КонецФункции

// Форматирует сумму со знаком валюты учёта справа.
// Разряды через неразрывный пробел (НПП), чтобы в HTML не схлопывались.
//
Функция ПредставлениеСуммыВВалютеУчета(Сумма, СЗнаком = Ложь) Экспорт
	
	ВалютаУчета = Константы.ВалютаУчета.Получить();
	Символ = СимволВалюты(ВалютаУчета);
	АбсолютнаяСумма = ?(Сумма < 0, -Сумма, Сумма);
	Представление = ПредставлениеЧислаСРазрядами(АбсолютнаяСумма);
	
	Если ЗначениеЗаполнено(Символ) Тогда
		
		Представление = Представление + " " + Символ;
		
	КонецЕсли;
	
	Если Не СЗнаком Тогда
		
		Возврат Представление;
		
	КонецЕсли;
	
	Если Сумма > 0 Тогда
		
		Возврат "+" + Представление;
		
	ИначеЕсли Сумма < 0 Тогда
		
		Возврат "−" + Представление;
		
	КонецЕсли;
	
	Возврат Представление;
	
КонецФункции

// Целое число с неразрывными пробелами по тысячам: 3150000 → «3 150 000».
// НПП не схлопывается в HTML WebView (в отличие от обычного пробела).
//
Функция ПредставлениеЧислаСРазрядами(Число)
	
	Цифры = Формат(Цел(Число), "ЧДЦ=0; ЧН=0; ЧГ=0");
	Результат = "";
	Разделитель = Символы.НПП;
	
	Пока СтрДлина(Цифры) > 3 Цикл
		
		Результат = Разделитель + Прав(Цифры, 3) + Результат;
		Цифры = Лев(Цифры, СтрДлина(Цифры) - 3);
		
	КонецЦикла;
	
	Возврат Цифры + Результат;
	
КонецФункции

// Сумма для вставки в HTML: разряды через &nbsp;, чтобы WebView не склеивал миллионы.
//
Функция ПредставлениеСуммыВВалютеУчетаДляHTML(Сумма, СЗнаком = Ложь) Экспорт
	
	Текст = ПредставлениеСуммыВВалютеУчета(Сумма, СЗнаком);
	Текст = СтрЗаменить(Текст, "&", "&amp;");
	Текст = СтрЗаменить(Текст, "<", "&lt;");
	Текст = СтрЗаменить(Текст, ">", "&gt;");
	Текст = СтрЗаменить(Текст, """", "&quot;");
	Текст = СтрЗаменить(Текст, Символы.НПП, "&nbsp;");
	Текст = СтрЗаменить(Текст, " ", "&nbsp;");
	
	Возврат Текст;
	
КонецФункции

// Текст предупреждения об отсутствии курса для показа пользователю.
//
Функция ТекстСообщенияОбОтсутствииКурса(Валюта, ДатаКурса) Экспорт
	
	ИспользоватьПоследний = Константы.ИспользоватьПоследнийИзвестныйКурс.Получить();
	
	Если ИспользоватьПоследний Тогда
		
		Возврат СтрШаблон(
			"Не найден курс валюты ""%1"". Обновите курсы в настройках или заполните регистр ""Курсы валют"".",
			Строка(Валюта));
		
	КонецЕсли;
	
	Возврат СтрШаблон(
		"Не указан курс валюты ""%1"" на %2. Нажмите «Обновить курсы сейчас» в настройках.",
		Строка(Валюта),
		Формат(ДатаКурса, "ДЛФ=D"));
	
КонецФункции

// Точка входа регламентного задания «Обновление курсов валют».
//
Процедура ОбновитьКурсыВалютРегламентно() Экспорт
	
	Если Константы.ИспользоватьПоследнийИзвестныйКурс.Получить() Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если Не Константы.АвтообновлениеКурсовВалют.Получить() Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ОбновитьКурсыВалют();
	
КонецПроцедуры

// Загружает курсы RUB / USD / EUR на дату относительно валюты учёта.
// Возвращает структуру: Успех, Текст, Обновлено, БезИзменений, Ошибки.
//
Функция ОбновитьКурсыВалют(ДатаКурса = Неопределено) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Успех", Ложь);
	Результат.Вставить("Текст", "");
	Результат.Вставить("Обновлено", 0);
	Результат.Вставить("БезИзменений", 0);
	Результат.Вставить("Ошибки", 0);
	
	ВалютаУчета = Константы.ВалютаУчета.Получить();
	
	Если Не ЗначениеЗаполнено(ВалютаУчета) Тогда
		
		Результат.Текст = "Не задана валюта учёта.";
		ЗаписатьВЖурналОбновленияКурсов(УровеньЖурналаРегистрации.Предупреждение, Результат.Текст);
		Возврат Результат;
		
	КонецЕсли;
	
	КодБазы = СокрЛП(ВалютаУчета.Код);
	
	Если Не ЗначениеЗаполнено(КодБазы) Тогда
		
		Результат.Текст = "У валюты учёта не заполнен код ISO.";
		ЗаписатьВЖурналОбновленияКурсов(УровеньЖурналаРегистрации.Предупреждение, Результат.Текст);
		Возврат Результат;
		
	КонецЕсли;
	
	Если ДатаКурса = Неопределено Тогда
		
		ДатаКурса = ТекущаяДата();
		
	КонецЕсли;
	
	ДатаКурса = НачалоДня(ДатаКурса);
	КурсыИзСети = ПолучитьКурсыИзИнтернета(КодБазы);
	
	Если Не КурсыИзСети.Успех Тогда
		
		Результат.Текст = КурсыИзСети.ТекстОшибки;
		ЗаписатьВЖурналОбновленияКурсов(УровеньЖурналаРегистрации.Ошибка, Результат.Текст);
		Возврат Результат;
		
	КонецЕсли;
	
	ВалютыОбновления = ВалютыДляОбновленияПоУмолчанию(ВалютаУчета);
	
	Если ВалютыОбновления.Количество() = 0 Тогда
		
		Результат.Успех = Истина;
		Результат.Текст = "Нет валют для обновления (все совпадают с валютой учёта).";
		Возврат Результат;
		
	КонецЕсли;
	
	Для Каждого Валюта Из ВалютыОбновления Цикл
		
		КодВалюты = СокрЛП(Валюта.Код);
		КурсИзСети = КурсыИзСети.Курсы.Получить(КодВалюты);
		
		Если КурсИзСети = Неопределено Или КурсИзСети <= 0 Тогда
			
			Результат.Ошибки = Результат.Ошибки + 1;
			Продолжить;
			
		КонецЕсли;
		
		СтатусЗаписи = ЗаписатьКурсВалютыЕслиКорректен(Валюта, ДатаКурса, КурсИзСети, 1);
		
		Если СтатусЗаписи = "updated" Тогда
			
			Результат.Обновлено = Результат.Обновлено + 1;
			
		ИначеЕсли СтатусЗаписи = "same" Тогда
			
			Результат.БезИзменений = Результат.БезИзменений + 1;
			
		Иначе
			
			Результат.Ошибки = Результат.Ошибки + 1;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Результат.Успех = (Результат.Обновлено + Результат.БезИзменений) > 0;
	
	Если Результат.Обновлено > 0 Тогда
		
		Результат.Текст = СтрШаблон("Курсы обновлены: %1. Без изменений: %2.",
			Результат.Обновлено, Результат.БезИзменений);
		
	ИначеЕсли Результат.БезИзменений > 0 Тогда
		
		Результат.Текст = "Курсы уже актуальны, изменений нет.";
		
	Иначе
		
		Результат.Текст = "Не удалось сохранить курсы валют.";
		
	КонецЕсли;
	
	Если Результат.Ошибки > 0 Тогда
		
		Результат.Текст = Результат.Текст + " Пропущено: " + Формат(Результат.Ошибки, "ЧГ=") + ".";
		
	КонецЕсли;
	
	Уровень = ?(Результат.Успех, УровеньЖурналаРегистрации.Информация, УровеньЖурналаРегистрации.Предупреждение);
	ЗаписатьВЖурналОбновленияКурсов(Уровень, Результат.Текст);
	
	Возврат Результат;
	
КонецФункции

// Включает/выключает регламентное задание по константам.
// При режиме «последний известный курс» автообновление принудительно выключается.
//
Процедура ПрименитьНастройкиАвтообновленияКурсов() Экспорт
	
	ИспользоватьПоследний = Константы.ИспользоватьПоследнийИзвестныйКурс.Получить();
	
	Если ИспользоватьПоследний И Константы.АвтообновлениеКурсовВалют.Получить() Тогда
		
		Константы.АвтообновлениеКурсовВалют.Установить(Ложь);
		
	КонецЕсли;
	
	ИспользоватьЗадание = Не ИспользоватьПоследний И Константы.АвтообновлениеКурсовВалют.Получить();
	УстановитьИспользованиеРегламентногоЗадания(ИспользоватьЗадание);
	
КонецПроцедуры

// Если включено автообновление и нет курса на сегодня — загружает курсы при старте приложения.
//
Процедура ОбновитьКурсыПриСтартеЕслиНужно() Экспорт
	
	Если Константы.ИспользоватьПоследнийИзвестныйКурс.Получить() Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если Не Константы.АвтообновлениеКурсовВалют.Получить() Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если ЕстьКурсыНаДату(НачалоДня(ТекущаяДата())) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ОбновитьКурсыВалют();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция КурсИзСрезаПоследних(Валюта, ДатаСреза)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	КурсыВалют.Период КАК Период,
	|	КурсыВалют.Курс КАК Курс,
	|	КурсыВалют.Кратность КАК Кратность
	|ИЗ
	|	РегистрСведений.КурсыВалют.СрезПоследних(&ДатаСреза, Валюта = &Валюта) КАК КурсыВалют
	|ГДЕ
	|	КурсыВалют.Курс > 0";
	Запрос.УстановитьПараметр("ДатаСреза", ДатаСреза);
	Запрос.УстановитьПараметр("Валюта", Валюта);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Не Выборка.Следующий() Тогда
		
		Возврат Неопределено;
		
	КонецЕсли;
	
	Кратность = ?(Выборка.Кратность = 0, 1, Выборка.Кратность);
	
	Результат = Новый Структура;
	Результат.Вставить("Курс", Выборка.Курс);
	Результат.Вставить("Кратность", Кратность);
	Результат.Вставить("Период", Выборка.Период);
	
	Возврат Результат;
	
КонецФункции

Функция КурсНаТочнуюДату(Валюта, ДатаСреза)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	КурсыВалют.Период КАК Период,
	|	КурсыВалют.Курс КАК Курс,
	|	КурсыВалют.Кратность КАК Кратность
	|ИЗ
	|	РегистрСведений.КурсыВалют КАК КурсыВалют
	|ГДЕ
	|	КурсыВалют.Валюта = &Валюта
	|	И КурсыВалют.Период = &ДатаСреза
	|	И КурсыВалют.Курс > 0";
	Запрос.УстановитьПараметр("ДатаСреза", ДатаСреза);
	Запрос.УстановитьПараметр("Валюта", Валюта);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Не Выборка.Следующий() Тогда
		
		Возврат Неопределено;
		
	КонецЕсли;
	
	Кратность = ?(Выборка.Кратность = 0, 1, Выборка.Кратность);
	
	Результат = Новый Структура;
	Результат.Вставить("Курс", Выборка.Курс);
	Результат.Вставить("Кратность", Кратность);
	Результат.Вставить("Период", Выборка.Период);
	
	Возврат Результат;
	
КонецФункции

Функция ВалютыДляОбновленияПоУмолчанию(ВалютаУчета)
	
	Результат = Новый Массив;
	Кандидаты = Новый Массив;
	Кандидаты.Добавить(Справочники.Валюта.Рубль);
	Кандидаты.Добавить(Справочники.Валюта.ДолларСША);
	Кандидаты.Добавить(Справочники.Валюта.Евро);
	
	Для Каждого Валюта Из Кандидаты Цикл
		
		Если Валюта <> ВалютаУчета Тогда
			
			Результат.Добавить(Валюта);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьКурсыИзИнтернета(КодБазы)
	
	Результат = Новый Структура("Успех, ТекстОшибки, Курсы", Ложь, "", Новый Соответствие);
	
	Попытка
		
		ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL;
		Соединение = Новый HTTPСоединение("open.er-api.com", 443, , , , 30, ЗащищенноеСоединение);
		Запрос = Новый HTTPЗапрос("/v6/latest/" + КодБазы);
		Ответ = Соединение.Получить(Запрос);
		
	Исключение
		
		Результат.ТекстОшибки = "Источник курсов недоступен. Проверьте интернет-соединение.";
		Возврат Результат;
		
	КонецПопытки;
	
	Если Ответ.КодСостояния <> 200 Тогда
		
		Результат.ТекстОшибки = "Источник курсов вернул код " + Формат(Ответ.КодСостояния, "ЧГ=") + ".";
		Возврат Результат;
		
	КонецЕсли;
	
	Тело = Ответ.ПолучитьТелоКакСтроку();
	
	Если Не ЗначениеЗаполнено(Тело) Тогда
		
		Результат.ТекстОшибки = "Источник курсов вернул пустой ответ.";
		Возврат Результат;
		
	КонецЕсли;
	
	Попытка
		
		Чтение = Новый ЧтениеJSON;
		Чтение.УстановитьСтроку(Тело);
		Данные = ПрочитатьJSON(Чтение, Истина);
		Чтение.Закрыть();
		
	Исключение
		
		Результат.ТекстОшибки = "Не удалось разобрать ответ источника курсов.";
		Возврат Результат;
		
	КонецПопытки;
	
	Если ТипЗнч(Данные) <> Тип("Соответствие") Тогда
		
		Результат.ТекстОшибки = "Некорректный формат ответа источника курсов.";
		Возврат Результат;
		
	КонецЕсли;
	
	Если Данные.Получить("result") <> "success" Тогда
		
		Результат.ТекстОшибки = "Источник курсов сообщил об ошибке.";
		Возврат Результат;
		
	КонецЕсли;
	
	ТаблицаКурсов = Данные.Получить("rates");
	
	Если ТипЗнч(ТаблицаКурсов) <> Тип("Соответствие") Тогда
		
		Результат.ТекстОшибки = "В ответе источника нет таблицы курсов.";
		Возврат Результат;
		
	КонецЕсли;
	
	Для Каждого КлючИЗначение Из ТаблицаКурсов Цикл
		
		КодВалюты = ВРег(Строка(КлючИЗначение.Ключ));
		ЗначениеКурсаAPI = ЧислоИзЗначенияJSON(КлючИЗначение.Значение);
		
		Если ЗначениеКурсаAPI <= 0 Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		// API: 1 база = ЗначениеКурсаAPI единиц валюты → нужен курс «единиц базы за 1 валюту».
		КурсКБазе = Окр(1 / ЗначениеКурсаAPI, 4);
		
		Если КурсКБазе > 0 Тогда
			
			Результат.Курсы.Вставить(КодВалюты, КурсКБазе);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если Результат.Курсы.Количество() = 0 Тогда
		
		Результат.ТекстОшибки = "Источник не вернул пригодные курсы.";
		Возврат Результат;
		
	КонецЕсли;
	
	Результат.Успех = Истина;
	Возврат Результат;
	
КонецФункции

Функция ЧислоИзЗначенияJSON(Значение)
	
	Если ТипЗнч(Значение) = Тип("Число") Тогда
		
		Возврат Значение;
		
	КонецЕсли;
	
	Попытка
		
		Возврат Число(Значение);
		
	Исключение
		
		Возврат 0;
		
	КонецПопытки;
	
КонецФункции

Функция ЗаписатьКурсВалютыЕслиКорректен(Валюта, ДатаКурса, Курс, Кратность)
	
	Если Не ЗначениеЗаполнено(Валюта) Или Курс <= 0 Или Кратность <= 0 Тогда
		
		Возврат "skip";
		
	КонецЕсли;
	
	ТекущиеДанные = КурсНаТочнуюДату(Валюта, ДатаКурса);
	
	Если ТекущиеДанные <> Неопределено
		И ТекущиеДанные.Курс = Курс
		И ТекущиеДанные.Кратность = Кратность Тогда
		
		Возврат "same";
		
	КонецЕсли;
	
	МенеджерЗаписи = РегистрыСведений.КурсыВалют.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период = ДатаКурса;
	МенеджерЗаписи.Валюта = Валюта;
	МенеджерЗаписи.Курс = Курс;
	МенеджерЗаписи.Кратность = Кратность;
	МенеджерЗаписи.Записать();
	
	Возврат "updated";
	
КонецФункции

Функция ЕстьКурсыНаДату(ДатаКурса)
	
	ВалютаУчета = Константы.ВалютаУчета.Получить();
	Валюты = ВалютыДляОбновленияПоУмолчанию(ВалютаУчета);
	
	Если Валюты.Количество() = 0 Тогда
		
		Возврат Истина;
		
	КонецЕсли;
	
	Для Каждого Валюта Из Валюты Цикл
		
		Если КурсНаТочнуюДату(Валюта, ДатаКурса) = Неопределено Тогда
			
			Возврат Ложь;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Процедура УстановитьИспользованиеРегламентногоЗадания(ИспользоватьЗадание)
	
	Попытка
		
		Отбор = Новый Структура("Метаданные", Метаданные.РегламентныеЗадания.ОбновлениеКурсовВалют);
		Задания = РегламентныеЗадания.ПолучитьРегламентныеЗадания(Отбор);
		
		Для Каждого Задание Из Задания Цикл
			
			Задание.Использование = ИспользоватьЗадание;
			
			Если ИспользоватьЗадание Тогда
				
				Расписание = Новый РасписаниеРегламентногоЗадания;
				Расписание.ПериодПовтораДней = 1;
				Расписание.ВремяНачала = Дата(1, 1, 1, 6, 0, 0);
				Задание.Расписание = Расписание;
				
			КонецЕсли;
			
			Задание.Записать();
			
		КонецЦикла;
		
	Исключение
		
		// На мобильном клиенте механизм регламентных заданий может быть недоступен —
		// автообновление выполняется при старте приложения.
		
	КонецПопытки;
	
КонецПроцедуры

Процедура ЗаписатьВЖурналОбновленияКурсов(Уровень, Текст)
	
	ЗаписьЖурналаРегистрации("Обновление курсов валют", Уровень, , , Текст);
	
КонецПроцедуры

#КонецОбласти
